INSERT INTO users
    (name, email)
VALUES ('Дмитрий1', 'dg@rubytech.ru'),
       ('Дмитрий2', 'do@rubytech.ru'),
       ('Сергей', 'st@rubytech.ru'),
       ('Ирина', 'iv@rubytech.ru'),
       ('Тимур', 'tg@rubytech.ru'),
       ('Алексей', 'as@rubytech.ru');

INSERT INTO items
    (name, description, is_available, owner_id)
VALUES ('экран', 'экран для домашнего кинотеатра', TRUE, 5),
       ('телескоп', 'увеличение 100', TRUE, 4),
       ('микроскоп', 'бытовой', TRUE, 4),
       ('насос', 'велосипедный', TRUE, 3),
       ('инвалидная коляска', 'на 150 кг', TRUE, 3),
       ('кислородный аппарат', 'бытовой', TRUE, 2),
       ('электропила', 'женский вариант', TRUE, 1),
       ('шлифовальная машина', '6 см полотно', TRUE, 1),
       ('болгарка', 'с насадками', TRUE, 1),
       ('шуруповёрт', '2 аккумулятора', TRUE, 1);

INSERT INTO bookings
    (start_date, end_date, item_id, booker_id, status)
VALUES ('2023-08-05 14:30:00.00', '2023-10-05 14:30:00.00', 1, 3, 'WAITING'),
       ('2023-11-05 14:30:00.00', '2023-12-05 14:30:00.00', 1, 3, 'WAITING'),
       ('2023-09-05 14:30:00.00', '2023-09-25 14:30:00.00', 5, 2, 'WAITING'),
       ('2023-07-05 14:30:00.00', '2023-08-05 14:30:00.00', 5, 2, 'REJECTED'),
       ('2023-04-05 14:30:00.00', '2023-05-05 14:30:00.00', 2, 1, 'APPROVED'),
       ('2023-06-05 14:30:00.00', '2023-07-05 14:30:00.00', 2, 6, 'APPROVED'),
       ('2023-07-05 14:30:00.00', '2023-08-05 14:30:00.00', 9, 2, 'APPROVED'),
       ('2023-08-05 14:30:00.00', '2023-09-05 14:30:00.00', 2, 3, 'WAITING'),
       ('2023-09-05 14:30:00.00', '2023-09-15 14:30:00.00', 9, 5, 'WAITING'),
       ('2023-10-05 14:30:00.00', '2023-10-25 14:30:00.00', 7, 5, 'WAITING'),
       ('2023-07-05 14:30:00.00', '2023-08-05 14:30:00.00', 7, 6, 'APPROVED'),
       ('2023-09-05 14:30:00.00', '2023-11-05 14:30:00.00', 6, 1, 'WAITING'),
       ('2023-07-05 14:30:00.00', '2023-08-05 14:30:00.00', 4, 5, 'CANCELED');

INSERT INTO requests
    (description, requester_id, created_date)
VALUES ('нужен спальный мешок', 6, '2023-10-25 14:30:00.00');

INSERT INTO comments
    (text, item_id, author_id, created_date)
VALUES ('всё увидел', 2, 1, '2023-08-05 15:30:00.00'),
       ('хорошо шкурит', 9, 2, '2023-08-05 15:30:00.00'),
       ('всё успел за час', 7, 6, '2023-08-05 15:30:00.00');